WB/src/Catalogs/Продавцы/Продавцы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Продавцы</name>
  <attributes>
    <name>НазваниеМагазина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенAPI</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ид</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ууид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

WB/src/Catalogs/Продавцы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьТокен(Ссылка) Экспорт
	
	Токен = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Продавцы.ТокенAPI КАК ТокенAPI
		|ИЗ
		|	Справочник.Продавцы КАК Продавцы
		|ГДЕ
		|	Продавцы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Токен = ВыборкаДетальныеЗаписи.ТокенAPI;
	КонецЦикла;
	
	Возврат Токен;
	
КонецФункции

Функция Загрузить(Токен) Экспорт
	
	ДанныеAPI = ИнформацияОПродавцеAPI.ПолучитьИнформациюОПродавце(Токен);
	ДанныеAPI = МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппингаИнформациюОПродавце());

	Если ДанныеAPI = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбновитьИлиСоздать(ДанныеAPI);
	
КонецФункции

Процедура ЗагрузитьВОбъект(Токен, Объект) Экспорт
	
	Если  Объект = Неопределено Тогда
		ВызватьИсключение("Не заполнен обязательный параметр объект", КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	ДанныеAPI = ИнформацияОПродавцеAPI.ПолучитьИнформациюОПродавце(Токен);
	ДанныеAPI = МаппингЗначений.ПрименитьМаппинг(ДанныеAPI, ПолучитьПараметрыМаппингаИнформациюОПродавце());
	
	Если ДанныеAPI = Неопределено Тогда
		ВызватьИсключение "Не удалось загрузить данные";
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбновитьИлиСоздать(ДанныеAPI)
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("Ууид", ДанныеAPI.Ууид);
	
	Если Ссылка = Неопределено Тогда
		Объект = СоздатьЭлемент();
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	Объект.Записать();
	
КонецФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI)
	
	МаппингЗначений.ЗаполнитьОбъектИзДанных(Объект, ДанныеAPI);
	
КонецПроцедуры

Функция ПолучитьПараметрыМаппингаРейтингПродавца()
	
	ПараметрыМаппинга = Новый Структура;
	ПараметрыМаппинга.Вставить("feedbackCount", "КоличествоОтзывов");
	ПараметрыМаппинга.Вставить("valuation", "РейтингПродавца");
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

Функция ПолучитьПараметрыМаппингаИнформациюОПродавце()
	
	ПараметрыМаппинга = Новый Структура;
	ПараметрыМаппинга.Вставить("name", Новый Структура("ИмяКлюча, ТипЗначения", "Наименование", Тип("Строка")));
	ПараметрыМаппинга.Вставить("sid", Новый Структура("ИмяКлюча, ТипЗначения", "Ууид", Тип("Строка")));
	ПараметрыМаппинга.Вставить("tin", Новый Структура("ИмяКлюча, ТипЗначения", "ИНН", Тип("Число")));
	ПараметрыМаппинга.Вставить("tradeMark", Новый Структура("ИмяКлюча, ТипЗначения", "НазваниеМагазина", Тип("Строка")));
	
	Возврат ПараметрыМаппинга;
	
КонецФункции

#КонецОбласти

#КонецЕсли
